export const OLD_JAPANESE_NUMERICS = {
  // 0
  零: '〇',
  // 1
  壱: '一',
  壹: '一',
  弌: '一',
  // 2
  弐: '二',
  貳: '二',
  貮: '二',
  弍: '二',
  // 3
  参: '三',
  參: '三',
  弎: '三',
  // 4
  肆: '四',
  亖: '四',
  // 5
  伍: '五',
  // 6
  陸: '六',
  // 7
  漆: '七',
  // 8
  捌: '八',
  // 9
  玖: '九',
  // 10
  拾: '十',
  什: '十',
  // 20
  廿: '二十',
  // 30
  卅: '三十',
  // 100
  陌: '百',
  佰: '百',
  // 1_000
  阡: '千',
  仟: '千',
  // 10_000
  萬: '万',
} as const;

export const JAPANESE_NUMERICS = {
  〇: 0,
  一: 1,
  二: 2,
  三: 3,
  四: 4,
  五: 5,
  六: 6,
  七: 7,
  八: 8,
  九: 9,
  '０': 0,
  '１': 1,
  '２': 2,
  '３': 3,
  '４': 4,
  '５': 5,
  '６': 6,
  '７': 7,
  '８': 8,
  '９': 9,
} as const;

export const JAPANESE_LARGE_NUMERICS = { 万: 10000, 千: 1000, 百: 100, 十: 10 };

const _TMP = {
  億: 8,
  兆: 12,
  京: 16,
  垓: 20,
  𥝱: 24,
  穣: 28,
  溝: 32,
  澗: 36,
  正: 40,
  載: 44,
  極: 48,
  恒河沙: 52,
  阿僧祇: 56,
  那由多: 60,
  不可思議: 64,
  無量大数: 68,
};
